#Taps
tap "buo/cask-upgrade"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "yqrashawn/goku"
tap "yt-dlp/taps"

#Brews (Packages)
brew "aspell"
brew "bat"
brew "cmake"
brew "coreutils"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "git"
brew "graphviz"
brew "isync"
brew "leiningen"
brew "mas"
brew "msmtp"
brew "mu"
brew "mvnvm"
brew "pandoc"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "borkdude/brew/clj-kondo"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-comp", "without-modules"]
brew "yqrashawn/goku/goku"
brew "yt-dlp/taps/yt-dlp"

# Casks (Applications)
cask "appcleaner"
cask "calibre"
cask "daisydisk"
cask "davmail"
cask "karabiner-elements"
cask "mactex"
cask "meetingbar"
cask "onyx"
cask "visual-studio-code"
cask "vlc"
cask "yed"
cask "zoom"

# Mac App Store
mas "1Focus", id: 969210610
mas "AdGuard for Safari", id: 1440147259
mas "Dark Reader for Safari", id: 1438243180
mas "Flow", id: 1423210932
mas "Focus for YouTube", id: 1514703160
mas "Ghostery Lite", id: 1436953057
mas "Hush", id: 1544743900
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "StopTheMadness", id: 1376402589
mas "Tayasui Sketches", id: 1178074963
mas "The Unarchiver", id: 425424353
mas "Unsplash Wallpapers", id: 1284863847
mas "Vimari", id: 1480933944
